<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>blog</title>
        
    <link rel="stylesheet" type="text/css" href="../static/css/main.css">
</head>
<body>
<div class="navbar navbar-line">
    <div class="container">
        <div class="logo">
            
                blog
            
        </div>
        <input type="checkbox" id="idoc_nav" />
        <div class="menu_tree">
        <ul><li><a href="../index.html">index</a></li><li><a href="../html/IB.html">IB</a></li><li><a href="../html/git.html">git</a></li><li><a href="../html/nodestart.html">nodestart</a></li><li><a href="../html/webstorm.html">webstorm</a></li><li class="active"><a href="../html/nodebasic.html">nodebasic</a></li><li><a href="../html/global.html">global</a></li><li><a href="../html/module.html">module</a></li><li><a href="../html/buffer.html">buffer</a></li><li><a href="../html/file.html">file</a></li><li><a href="../html/event.html">event</a></li><li><a href="../html/stream.html">stream</a></li><li><a href="../html/http.html">http</a></li><li><a href="../html/ajax.html">ajax</a></li><li><a href="../html/jsonp.html">jsonp</a></li><li><a href="../html/cross.html">cross</a></li><li><a href="../html/http2.html">http2</a></li></ul>    
        </div>
        
        

        <section class="idoc_nav_btn">
            <label for="idoc_nav"><span></span></label>
        </section>
    </div>
    
</div>




<div class="container">

    <div class="page-toc">
        <ul></ul>
    </div>
    
    <div class="content markdown-body">
        <p>title: D.node&#x57FA;&#x7840;</p>
<p>transition: cards
theme: blue
highlightStyle:javascript</p>
<p>[slide]</p>
<p>##node&#x662F;&#x4EC0;&#x4E48;</p>
<ul>
<li>Node.js&#x662F;&#x4E00;&#x4E2A;&#x8BA9;JS&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E4B;&#x5916;&#x7684;<span class="red">&#x670D;&#x52A1;&#x5668;&#x7AEF;</span>&#x7684;&#x5E73;&#x53F0;   {:&amp;.zoomIn}</li>
<li>&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x8BF8;&#x5982;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x6A21;&#x5757;&#x3001;&#x5305;&#x3001;<span class="red">&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;API</span>&#xFF0C;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7B49;&#x6838;&#x5FC3;JS&#x6CA1;&#x6709;&#x6216;&#x4E0D;&#x5B8C;&#x5584;&#x7684;&#x529F;&#x80FD;   </li>
<li>&#x5B83;&#x6452;&#x5F03;&#x4F20;&#x7EDF;&#x5E73;&#x53F0;&#x4F9D;&#x8D56;&#x591A;&#x7EBF;&#x7A0B;&#x6765;&#x5B9E;&#x73B0;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#xFF0C;&#x800C;&#x91C7;&#x7528;<span class="red">&#x5355;&#x7EBF;&#x7A0B;</span>&#xFF0C;<span class="red">&#x5F02;&#x6B65;&#x5F0F;I/O</span>&#xFF0C;<span class="red">&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;</span>&#x5F0F;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x6A21;&#x578B;  </li>
<li>Node.js&#x4F7F;&#x7528;&#x4E86;&#x6765;&#x81EA;&#x4E8E;Google ChromeV8&#x5F15;&#x64CE;&#x3002;V8&#x662F;&#x76EE;&#x524D;&#x4E16;&#x754C;&#x4E0A;<span class="red">&#x6700;&#x5FEB;</span>&#x7684;Javascript&#x5F15;&#x64CE;</li>
</ul>
<p>[slide]</p>
<p>#node.js&#x7684;&#x4F18;&#x70B9;</p>
<ul>
<li>Nodejs&#x57FA;&#x4E8E;Javascript&#x8BED;&#x8A00; {:&amp;.zoomIn}</li>
<li><em>&#x7EDF;&#x4E00;</em>&#x516C;&#x5171;&#x7C7B;&#x5E93;&#xFF0C;&#x4EE3;&#x7801;<em>&#x6807;&#x51C6;</em>&#x5316;</li>
<li>Nodejs&#x9009;&#x62E9;&#x4E86;&#x76EE;&#x524D;&#x6700;<em>&#x5FEB;</em>&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5185;&#x6838;V8&#x505A;&#x4E3A;&#x6267;&#x884C;&#x5F15;&#x64CE;</li>
<li>Nodejs&#x7684;&#x793E;&#x533A;&#x975E;&#x5E38;<em>&#x6D3B;&#x8DC3;</em></li>
</ul>
<p>[note]</p>
<ul>
<li>Nodejs&#x57FA;&#x4E8E;Javascript&#x8BED;&#x8A00;&#xFF0C;&#x4E0D;&#x7528;&#x518D;&#x5355;&#x72EC;&#x65B0;&#x5B66;&#x4E00;&#x95E8;&#x964C;&#x751F;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x4F4E;&#x4E86;&#x5B66;&#x4E60;&#x7684;&#x95E8;&#x69DB;&#x3002;
&#x540C;&#x65F6;&#xFF0C;Javascript&#x8BED;&#x8A00;&#x5728;Web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4E2D;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x7279;&#x522B;HTML5&#x7684;&#x5E94;&#x7528;&#x5FC5;&#x987B;&#x8981;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x524D;&#x540E;&#x53F0;&#x7EDF;&#x4E00;&#x8BED;&#x8A00;&#xFF0C;
&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5168;&#x6808;&#x5F00;&#x53D1;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7EDF;&#x4E00;&#x516C;&#x5171;&#x7C7B;&#x5E93;&#xFF0C;&#x4EE3;&#x7801;&#x6807;&#x51C6;&#x5316;&#x3002;&#x5355;&#x51ED;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;Nodejs&#x5C31;&#x5DF2;&#x7ECF;&#x8D62;&#x5F97;&#x5E02;&#x573A;&#x7684;&#x9752;&#x7750;&#x4E86;&#x3002;</li>
<li>Nodejs&#x5E76;&#x6CA1;&#x6709;&#x91CD;&#x65B0;&#x5F00;&#x53D1;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#xFF0C;&#x800C;&#x662F;&#x9009;&#x62E9;&#x4E86;&#x76EE;&#x524D;&#x6700;&#x5FEB;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5185;&#x6838;V8&#x505A;&#x4E3A;&#x6267;&#x884C;&#x5F15;&#x64CE;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;Nodejs&#x7684;&#x6027;&#x80FD;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x3002;</li>
<li>Nodejs&#x7684;&#x5F00;&#x53D1;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#xFF0C;&#x800C;&#x4E14;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#xFF0C;&#x5F97;&#x76CA;&#x4E8E;Nodejs&#x7684;&#x5355;&#x7EBF;&#x7A0B;&#x673A;&#x5236;&#x3002;&#x800C;Nodejs&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#xFF0C;
&#x8BA9;Nodejs&#x5904;&#x7406;IO&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;&#x6709;&#x4E86;&#x660E;&#x663E;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#xFF0C;&#x7528;Nodejs&#x6BD4;Java&#x505A;Web&#x5F00;&#x53D1;&#x8981;&#x9AD8;&#x6548;10&#x500D;&#xFF0C;&#x6BD4;PHP&#x7684;&#x4EE3;&#x7801;&#x8FD8;&#x8981;&#x7B80;&#x5355;&#x3002;</li>
<li>Nodejs&#x7684;&#x793E;&#x533A;&#x5728;&#x58EE;&#x5927;&#xFF0C;&#x4E0D;&#x4EC5;&#x5305;&#x7684;&#x6570;&#x91CF;&#x5728;&#x5FEB;&#x901F;&#x589E;&#x52A0;&#xFF0C;&#x800C;&#x4E14;&#x5305;&#x7684;&#x8D28;&#x91CF;&#x4E5F;&#x8981;&#x660E;&#x663E;&#x597D;&#x4E8E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x3002;&#x5F88;&#x591A;&#x660E;&#x661F;&#x7EA7;&#x7684;&#x5305;&#xFF0C;&#x90FD;&#x662F;&#x7B80;&#x5355;&#x800C;&#x7075;&#x5DE7;&#x7684;&#xFF0C;
&#x4E3A;&#x4E86;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x4F7F;&#x7528;&#x4E60;&#x60EF;&#x800C;&#x8BBE;&#x8BA1;&#x3002;&#x6211;&#x6700;&#x5E38;&#x7528;&#x5230;&#x7684;&#x5DE5;&#x5177;&#x5305;&#xFF0C;&#x5982;socket.io, moment.js, underscore.js, async.js,<br>express.js, bower.js, grunt.js, forever.js&#x2026;&#xFF0C;&#x786E;&#x5B9E;&#x5728;&#x6539;&#x53D8;&#x6211;&#x4EE5;&#x524D;&#x7684;&#x7F16;&#x7A0B;&#x4E60;&#x60EF;&#x3002;  </li>
<li>&#x52A8;&#x6001;&#x8BED;&#x8A00;&#xFF1A;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x5E76;&#x6709;&#x80FD;&#x529B;&#x6784;&#x5EFA;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;ql.io&#x3002;  </li>
<li>&#x6027;&#x80FD;&#x548C;I/O&#x8D1F;&#x8F7D;&#xFF1A;Nodejs&#x975E;&#x5E38;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x4E86;IO&#x5BC6;&#x96C6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x8FC7;&#x5F02;&#x6B65;IO&#x6765;&#x5B9E;&#x73B0;&#x3002;  </li>
<li>&#x8FDE;&#x63A5;&#x7684;&#x5185;&#x5B58;&#x5F00;&#x9500;&#xFF1A;&#x6BCF;&#x4E2A;Node.js&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x8D85;&#x8FC7;12&#x4E07;&#x6D3B;&#x8DC3;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#x6D88;&#x8017;&#x5927;&#x7EA6;2K&#x7684;&#x5185;&#x5B58;&#x3002;  </li>
<li>&#x64CD;&#x4F5C;&#x6027;&#xFF1A;&#x5B9E;&#x73B0;&#x4E86;Nodejs&#x5BF9;&#x4E8E;&#x5185;&#x5B58;&#x5806;&#x6808;&#x7684;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x3002;<br>[/note]</li>
</ul>
<p>[slide]</p>
<p>#NODE&#x6982;&#x5FF5;
<img src="http://7xjf2l.com2.z0.glb.qiniucdn.com/nodeeat.jpg" class="img-responsive"></p>
<p>[slide]</p>
<p>##&#x4EC0;&#x4E48;&#x662F;&#x56DE;&#x8C03;</p>
<ul>
<li>&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x57FA;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x5F02;&#x6B65;&#x5904;&#x7406;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x822C;&#x91C7;&#x7528;<span class="text-warning">&#x540E;&#x7EED;&#x4F20;&#x9012;</span>&#x7684;&#x65B9;&#x5F0F;&#x3002;</li>
<li>&#x5C06;&#x540E;&#x7EED;&#x903B;&#x8F91;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;<span class="text-warning">&#x53C2;&#x6570;</span></li>
</ul>
<p>[slide]</p>
<p>##&#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;</p>
<ul>
<li>&#x540C;&#x6B65;&#x662F;&#x6307;&#x53D1;&#x8D77;&#x8C03;&#x7528;&#x4E4B;&#x540E;&#x4E3B;&#x7EBF;&#x7A0B;&#x53EA;&#x80FD;&#x6302;&#x8D77;,&#x8C03;&#x7528;&#x8005;<span class="text-warning">&#x4E3B;&#x52A8;</span>&#x7B49;&#x5F85;&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x7684;&#x7ED3;&#x679C;</li>
<li>&#x5F02;&#x6B65;&#x662F;&#x6307;&#x53D1;&#x8D77;&#x8C03;&#x7528;&#x4E4B;&#x540E;&#x4E3B;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x505A;&#x522B;&#x7684;&#x4E8B;&#x60C5;,&#x88AB;&#x8C03;&#x7528;&#x8005;&#x901A;&#x8FC7;<span class="text-warning">&#x901A;&#x77E5;</span>&#x6765;&#x544A;&#x77E5;&#x8C03;&#x7528;&#x8005;&#x7ED3;&#x679C;</li>
</ul>
<p>[note]</p>
<ol>
<li>&#x6240;&#x8C13;&#x540C;&#x6B65;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x4E4B;&#x524D;&#xFF0C;&#x8BE5;&#x8C03;&#x7528;&#x5C31;&#x4E0D;&#x8FD4;&#x56DE;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x8FD4;&#x56DE;&#x503C;&#x4E86;&#x3002;
&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x7531;&#x8C03;&#x7528;&#x8005;&#x4E3B;&#x52A8;&#x7B49;&#x5F85;&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
<li>&#x800C;&#x5F02;&#x6B65;&#x5219;&#x662F;&#x76F8;&#x53CD;&#xFF0C;&#x8C03;&#x7528;&#x5728;&#x53D1;&#x51FA;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x5C31;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;
&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x53D1;&#x51FA;&#x540E;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x4E0D;&#x4F1A;&#x7ACB;&#x523B;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x3002;
&#x800C;&#x662F;&#x5728;&#x8C03;&#x7528;&#x53D1;&#x51FA;&#x540E;&#xFF0C;&#x88AB;&#x8C03;&#x7528;&#x8005;&#x901A;&#x8FC7;&#x72B6;&#x6001;&#x3001;&#x901A;&#x77E5;&#x6765;&#x901A;&#x77E5;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x6216;&#x901A;&#x8FC7;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x3002;
&#x8BA9;&#x53A8;&#x5E08;&#x505A;&#x996D;&#x7684;&#x65F6;&#x5019;,&#x670D;&#x52A1;&#x5458;&#x53EF;&#x4EE5;&#x4E0D;&#x7B49;&#x5F85;
[/note]</li>
</ol>
<p>[slide]</p>
<p>##&#x4EC0;&#x4E48;&#x662F;&#x963B;&#x585E;/&#x975E;&#x963B;&#x585E;</p>
<ul>
<li>&#x9488;&#x5BF9;<span class="red">&#x5185;&#x6838;</span>&#x6765;&#x8BF4;&#x7684;,&#x5411;&#x5185;&#x6838;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;</li>
<li>&#x975E;&#x963B;&#x585E;&#x662F;&#x5B9E;&#x73B0;&#x5F02;&#x6B65;&#x7684;<span class="red">&#x524D;&#x7F6E;</span>&#x6761;&#x4EF6;</li>
</ul>
<p>[note]</p>
<ol>
<li>&#x9488;&#x5BF9;&#x5185;&#x6838;&#x6765;&#x8BF4;&#x7684;,&#x5411;&#x5185;&#x6838;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;</li>
<li>&#x975E;&#x963B;&#x585E;&#x662F;&#x5B9E;&#x73B0;&#x5F02;&#x6B65;&#x7684;&#x524D;&#x7F6E;&#x6761;&#x4EF6;
[/note]</li>
</ol>
<p>[slide]</p>
<p>##&#x4EC0;&#x4E48;&#x662F;IO</p>
<ul>
<li>Input(&#x8F93;&#x5165;) &#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;<span class="red">&#x8BFB;&#x53D6;</span>&#x6587;&#x4EF6;</li>
<li>Output(&#x8F93;&#x51FA;) &#x5411;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;<span class="red">&#x5199;&#x5165;</span>&#x6587;&#x4EF6;</li>
</ul>
<p>[slide]</p>
<p>##&#x4EC0;&#x4E48;&#x662F;&#x5355;&#x7EBF;&#x7A0B;/&#x591A;&#x7EBF;&#x7A0B;</p>
<ul>
<li>&#x5355;&#x7EBF;&#x7A0B;&#x6307;&#x7A0B;&#x5E8F;&#x6309;<span class="red">&#x987A;&#x5E8F;</span>&#x6267;&#x884C;&#xFF0C;&#x524D;&#x9762;&#x6D41;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;,&#x540E;&#x9762;&#x7684;&#x6D41;&#x7A0B;&#x624D;&#x80FD;&#x6267;&#x884C;&#x5230;</li>
<li>&#x591A;&#x7EBF;&#x7A0B;&#x6307;<span class="red">&#x540C;&#x65F6;</span>&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x8FB9;&#x770B;&#x7535;&#x89C6;&#xFF0C;&#x4E00;&#x8FB9;&#x7761;&#x89C9;,&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;<span class="red">&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;</span>&#x6765;&#x5F25;&#x8865;&#x540C;&#x6B65;&#x5F0F;IO&#x8C03;&#x7528;&#x65F6;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;</li>
<li>Node&#x5355;&#x7EBF;&#x7A0B;&#x6307;&#x7684;&#x662F;<span class="red">&#x4E3B;&#x7EBF;&#x7A0B;</span>&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x963B;&#x585E;&#x7684;&#x90E8;&#x5206;&#x4EA4;&#x7ED9;&#x4E00;&#x4E2A;<span class="red">&#x7EBF;&#x7A0B;&#x6C60;</span>&#x5904;&#x7406;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x4E3B;&#x7EBF;&#x7A0B;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x8DDF;&#x7EBF;&#x7A0B;&#x6C60;&#x534F;&#x4F5C;</li>
</ul>
<p>[note]</p>
<ol>
<li>JS&#x4EE3;&#x7801;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x5E76;&#x4E14;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x6267;&#x884C;&#x4E00;&#x6B21;</li>
<li>&#x7A0B;&#x5E8F;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x524D;&#x9762;&#x6D41;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#x540E;&#x9762;&#x7684;&#x6D41;&#x7A0B;&#x624D;&#x80FD;&#x6267;&#x884C;&#x5230;</li>
<li>&#x4E00;&#x8FB9;&#x6253;&#x770B;&#x7535;&#x89C6;&#xFF0C;&#x4E00;&#x8FB9;&#x78D5;&#x74DC;&#x5B50;,&#x8FD8;&#x80FD;&#x4E00;&#x8FB9;&#x804A;&#x5929;</li>
<li>node.js&#x9664;&#x4E86;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x662F;&#x91C7;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x6BCF;&#x4E2A;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;
&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x5207;&#x6362;&#x6765;&#x5F25;&#x8865;&#x540C;&#x6B65;&#x5F0F;IO&#x8C03;&#x7528;&#x65F6;&#x7684;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#xFF0C;</li>
<li>Node.js&#x4F7F;&#x7528;&#x4E86;&#x5355;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684;IO&#x90FD;&#x91C7;&#x7528;&#x4E86;&#x5F02;&#x6B65;&#x5F0F;&#x7684;&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x9891;&#x7E41;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x3002;
&#x65E2;&#x7136; Node.js &#x662F;&#x5355;&#x7EBF;&#x7A0B;&#xFF0C;&#x53C8;&#x662F;&#x600E;&#x4E48;&#x505A;&#x5230;&#x652F;&#x6301;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#xFF1F;</li>
<li>&#x5355;&#x7EBF;&#x7A0B;&#x6307;&#x7684;&#x662F;&#x4E3B;&#x7EBF;&#x7A0B;&#x662F;&#x201C;&#x5355;&#x7EBF;&#x7A0B;&#x201D;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x963B;&#x585E;&#x7684;&#x90E8;&#x5206;&#x4EA4;&#x7ED9;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6C60;&#x5904;&#x7406;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x4E3B;&#x7EBF;&#x7A0B;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x8DDF;&#x7EBF;&#x7A0B;&#x6C60;&#x534F;&#x4F5C;&#xFF0C;
&#x4E8E;&#x662F;&#x5BF9;&#x6211;&#x4EEC;&#x5199;&#x5230;&#x7684;js&#x4EE3;&#x7801;&#x90E8;&#x5206;&#xFF0C;&#x4E0D;&#x518D;&#x5173;&#x5FC3;&#x7EBF;&#x7A0B;&#x95EE;&#x9898;&#xFF0C;&#x4EE3;&#x7801;&#x4E5F;&#x4E3B;&#x8981;&#x7531;&#x4E00;&#x5806;callback&#x56DE;&#x8C03;&#x6784;&#x6210;&#xFF0C;&#x7136;&#x540E;&#x4E3B;&#x7EBF;&#x7A0B;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x5FAA;&#x73AF;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;
&#x9002;&#x65F6;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x3002;
[/note]</li>
</ol>
<p>[slide]</p>
<p>##&#x4EC0;&#x4E48;&#x662F;&#x4E8B;&#x4EF6;
&#x662F;&#x6307;&#x53D1;&#x751F;&#x4E86;&#x67D0;&#x79CD;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x4F1A;<span class="red">&#x89E6;&#x53D1;</span>&#x5176;&#x5B83;&#x52A8;&#x4F5C;&#x7684;&#x53D1;&#x751F;</p>
<p>[note]
&#x9F20;&#x6807;&#x70B9;&#x51FB;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;
&#x6CE8;&#x518C;&#x51FD;&#x6570;&#x4E0D;&#x4F1A;&#x9A6C;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x53EA;&#x6709;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x624D;&#x4F1A;&#x6267;&#x884C;
[/note]</p>
<p>[slide]</p>
<p>##&#x4EC0;&#x4E48;&#x662F;&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;
&#x4E0D;&#x662F;&#x7ACB;&#x523B;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x7B49;&#x67D0;&#x4E2A;<span class="red">&#x4E8B;&#x4EF6;&#x53D1;&#x751F;</span>&#x4E4B;&#x540E;&#x624D;&#x4F1A;&#x6267;&#x884C;&#x7684;&#x51FD;&#x6570;&#x5C31;&#x53EB;&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;</p>
<p>[note]</p>
<ol>
<li>&#x8FD9;&#x79CD;&#x56DE;&#x8C03;&#x5C31;&#x662F;&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x56DE;&#x8C03;</li>
<li>&#x57FA;&#x4E8E;&#x56DE;&#x8C03;&#x7684;&#x5F02;&#x6B65;IO
[/note]</li>
</ol>
<p>[slide]</p>
<p>##&#x4EC0;&#x4E48;&#x662F;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;</p>
<ul>
<li>&#x7BA1;&#x7406;&#x5F02;&#x6B65;&#x52A8;&#x4F5C;&#x3001;&#x5B9A;&#x65F6;&#x5668;&#x548C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x673A;&#x5236;&#x53EB;<span class="red">&#x4E8B;&#x4EF6;&#x73AF;</span></li>
<li>&#x5F02;&#x6B65;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x538B;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x7136;&#x540E;&#x4E0D;&#x505C;&#x8BFB;&#x53D6;&#x4E8B;&#x4EF6;&#xFF0C;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x540E;&#x4F1A;&#x628A;&#x5BF9;&#x5E94;&#x7684;&#x56DE;&#x8C03;<span class="red">&#x52A0;&#x5165;&#x961F;&#x5217;</span></li>
<li>&#x961F;&#x5217;&#x6309;&#x52A0;&#x5165;&#x7684;<span class="red">&#x987A;&#x5E8F;</span>&#x4F9D;&#x6B21;&#x6267;&#x884C;&#xFF0C;&#x7531;&#x666E;&#x901A;&#x51FD;&#x6570;&#x548C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7EC4;&#x6210;&#x3002;</li>
</ul>
<p>[note]</p>
<ol>
<li>&#x6709;&#x5927;&#x91CF;&#x7684;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#xFF0C;&#x5B9A;&#x65F6;&#x5668;&#x4E4B;&#x7C7B;&#x7684;&#x5B83;&#x4EEC;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x8981;&#x5B8C;&#x6210;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x5B8C;&#x6210;&#x5BC6;&#x96C6;&#x4EFB;&#x52A1;
&#xFF0C;&#x8FD9;&#x4E9B;&#x5927;&#x91CF;&#x7684;&#x4E8B;&#x4EF6;&#x9700;&#x8981;&#x7BA1;&#x7406;&#xFF0C;&#x8FD9;&#x79CD;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x5C31;&#x662F;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;</li>
<li>&#x5F02;&#x6B65;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x538B;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x5355;&#x7EBF;&#x7A0B;&#x4E0D;&#x65AD;&#x67E5;&#x8BE2;&#x662F;&#x5426;&#x6709;&#x4E8B;&#x4EF6;&#xFF0C;&#x8BFB;&#x5230;&#x4E8B;&#x4EF6;&#x540E;&#x8C03;&#x7528;&#x5173;&#x8054;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;</li>
<li>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x961F;&#x5217;&#x7ED3;&#x6784;,&#x6309;&#x52A0;&#x5165;&#x7684;&#x987A;&#x5E8F;&#x4F9D;&#x6B21;&#x6267;&#x884C;&#xFF0C;&#x7531;&#x666E;&#x901A;&#x51FD;&#x6570;&#x548C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7EC4;&#x5408;&#x7684;&#x961F;&#x5217;&#x96C6;&#x5408;&#x3002;</li>
<li>&#x5728;Node.js&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#xFF0C;&#x7A0B;&#x5E8F;&#x5728;&#x6267;&#x884C;&#x65F6;&#x8FDB;&#x5165;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x5FAA;&#x73AF;&#xFF0C;&#x7B49;&#x5F85;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x5230;&#x6765;&#xFF0C;</li>
<li>&#x6BCF;&#x4E2A;&#x5F02;&#x6B65;&#x5F0F;&#x8C03;&#x7528;&#x5B8C;&#x6210;&#x540E;&#x4F1A;&#x88AB;&#x63A8;&#x9001;&#x5230;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x7B49;&#x5F85;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</li>
<li>&#x7528;&#x6237;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7528;&#x9F20;&#x6807;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x6216;&#x8F93;&#x5165;&#x6587;&#x5B57;&#x4F1A;&#x89E6;&#x53D1;&#x4E8B;&#x4EF6;&#xFF0C;&#x5728;Node.js&#x4E2D;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;
&#x901A;&#x8FC7;&#x6B64;&#x8FDE;&#x63A5;&#x63A5;&#x6536;&#x63D0;&#x4EA4;&#x6570;&#x636E;&#x90FD;&#x4F1A;&#x89E6;&#x53D1;&#x4E8B;&#x4EF6;&#x3002;&#x5728;Node.js&#x4E2D;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x65F6;&#x523B;&#x53EA;&#x80FD;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;</li>
<li>&#x4F46;&#x662F;&#x5728;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x4E2D;&#x9014;&#x53EF;&#x4EE5;&#x8F6C;&#x800C;&#x5904;&#x7406;&#x5176;&#x5B83;&#x4E8B;&#x4EF6;(&#x5305;&#x62EC;&#x89E6;&#x53D1;&#x65B0;&#x7684;&#x4E8B;&#x4EF6;&#x3001;&#x58F0;&#x660E;&#x8BE5;&#x4E8B;&#x4EF6;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7B49;)&#xFF0C;
&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x79CD;&#x5904;&#x7406;&#x673A;&#x5236;&#x79F0;&#x4E3A;&#x4E8B;&#x4EF6;&#x73AF;&#x3002;</li>
<li>EventLoop&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#xFF0C;&#x7528;&#x4E8E;&#x7B49;&#x5F85;&#x548C;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x548C;&#x4E8B;&#x4EF6;
&#x7B80;&#x5355;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x91CC;&#x8BBE;&#x7F6E;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x79F0;&#x4E3A;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E0E;
&#x5176;&#x5B83;&#x8FDB;&#x7A0B;(&#x4E3B;&#x8981;&#x662F;I/O&#x64CD;&#x4F5C;)&#x7684;&#x901A;&#x4FE1;,&#x88AB;&#x79F0;&#x4E3A;EventLoop&#x7EBF;&#x7A0B;(&#x53EF;&#x79F0;&#x4E3A;&#x6D88;&#x606F;&#x7EBF;&#x7A0B;)
[/note]</li>
</ol>

        <div class="copyright">Powered by <a href="https://github.com/jaywcjlove/idoc" target="_blank">idoc</a>. Dependence <a href="https://nodejs.org">Node.js</a> run.</div>
    </div>

</div>

<style>
    .page-toc{
        overflow: hidden;
        position:fixed;
        left:50%;
        margin-left:250px;
	width:350px
    }
    .page-toc > ul li{
        list-style-position: inside;
	line-height:120%
    }
    .page-toc > ul{
        transition: all 0.2s;
        position: relative;
    }
    .page-toc > ul a {
	color:#009a61;
	font-size:110% ! important;
	line-height:120%
    }
    .page-toc > ul .red{
        background: #f3f3f3;
        z-index: 1;
        border-left: 3px solid #009a61;
        -webkit-transition: all .2s ease;
        transition: all .2s ease;
	color:#000
    }

    .markdown-body{
	font-size: 120% ! important;
        max-width:800px;
    }
    .container{
       font-size: 110% ! important;
    }
    html,body,.container{
      font-family: Helvetica Neue,Helvetica,Arial,PingFang SC,Hiragino Sans GB,WenQuanYi Micro Hei,Microsoft Yahei,sans-serif ! important;
    }
    .markdown-body pre code{
        font-size: 20px;
        line-height: 24px;
    }
</style>
<script src="https://cdn.bootcss.com/jquery/3.0.0/jquery.js"></script>
<script>

var bar = $(window).height() - $('.navbar ').height() - $('.page-toc').position().top;
var count =  bar/26/2;
var barHeight = $('.page-toc').outerHeight();
$('.page-toc li').eq(0).children('a').addClass('red');
var arr = [];
$("h2,h3").each(function () {
    arr.push($(this).position().top);
});
if(!($(window).height()-50 > barHeight)){
    var flagTop = true;
}
function dark(){
    var top =  Math.abs($('.page-toc > ul').position().top);
    var cur = $(document).scrollTop();
    for(var i = arr.length; i >=0;i--){
        if(arr[i]<=cur){
            break;
        }
    }
    if(i===-1){
        i = 0;
    }
    $('.page-toc li a').removeClass('red');
    $('.page-toc li').eq(i).children('a').addClass('red');
    if(flagTop){
      if(i> arr.length-count){
          $(' .page-toc > ul').css('top',-(barHeight-bar));
          return;
      }
      if(i>count){
          $(' .page-toc > ul').css('top',-26*(i-count));
      }else{
          $(' .page-toc > ul').css('top',0);
      }
    }
}
$(window).on('scroll',dark);
</script>
</body>
</html>
